src/cf/InformationRegisters/CRM_ОбъектыПоБизнесПроцессам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_ОбъектыПоБизнесПроцессам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_ВидыОбъектовБизнесПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.CRM_БизнесПроцесс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТочкиМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CRM_ВидыОбъектовБизнесПроцессов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/CRM_ОбъектыПоБизнесПроцессам/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Отбор") И ТипЗнч(Параметры.Отбор) = Тип("Структура") Тогда
		Если	Параметры.Отбор.Свойство("Задача")
			И	ТипЗнч(Параметры.Отбор.Задача) = Тип("ЗадачаСсылка.ЗадачаИсполнителя")
			И	Не Параметры.Отбор.Свойство("БизнесПроцесс") Тогда
			//
			Если ЗначениеЗаполнено(Параметры.Отбор.Задача.БизнесПроцесс) Тогда
				БизнесПроцесс = Параметры.Отбор.Задача.БизнесПроцесс;
				Параметры.Отбор.Удалить("Задача");
				Параметры.Отбор.Вставить("БизнесПроцесс", БизнесПроцесс);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "Задача" Тогда
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Задача);
	Иначе	
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Объект);
	КонецЕсли;
	
КонецПроцедуры
